# Homebrew Bundle file
# Generated for chezmoi management

# Taps
tap "homebrew/cask-fonts"

# Formulas
brew "autoconf"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "chezmoi"
brew "fzf"
brew "gettext"
brew "icu4c@77"
brew "libnghttp2"
brew "libunistring"
brew "libuv"
brew "lpeg"
brew "luajit"
brew "luv"
brew "m4"
brew "ncurses"
brew "neovim"
brew "node"
brew "openssl@3"
brew "pcre2"
brew "pkgconf"
brew "pyenv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "tree-sitter"
brew "unibilium"
brew "utf8proc"
brew "zsh"

# Casks
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "kitty"
cask "podman-desktop"
cask "visual-studio-code"
cask "wezterm"

# Additional casks from install script
cask "font-jetbrains-mono"